yii-basic-app-2.0.6/basic/controllers/IndexController.php

SELECT COUNT(*) FROM `liuyan`
SELECT * FROM `liuyan` LIMIT 5 OFFSET 5
---
    public function actionIndex(){
        $data=Liuyan::find();
        $pages=new Pagination(['totalCount'=>$data->count(),'pagesize'=>'5']);
        $models=$data->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `liuyan` WHERE `id`='16'
DELETE FROM `liuyan` WHERE `id`=16
SELECT COUNT(*) FROM `liuyan`
SELECT * FROM `liuyan` LIMIT 5
---
    public function actionDelete(){
        $id = $_GET['id'];
        //echo $id;die;
        $customer = Liuyan::findOne($id);
        $arr = $customer->delete();
        $data=Liuyan::find();
        $pages=new Pagination(['totalCount'=>$data->count(),'pagesize'=>'5']);
        $models=$data->offset($pages->offset)->limit($pages->limit)->all();

INSERT INTO `liuyan` (`lname`, `content`, `ltime`) VALUES ('1', '1', '2016-03-24 12:20:25')
---
    public function actionDoadd(){
        //print_r($_POST);die;
        $name = $_POST['uname'];
        $content = $_POST['content'];
        $time=date('Y-m-d H:i:s',time());
        $customer = new Liuyan();
        $customer->lname = $name;
        $customer->content = $content;
        $customer->ltime = $time;
        $customer->save();

SELECT * FROM `liuyan` WHERE `id`='1'
---
    public function actionUpdate(){
        $id = $_GET['id'];
        //echo $id;die;
        $data=Liuyan::find()->asArray()->where(['id'=>$id])->all();

SELECT * FROM `liuyan` WHERE `id`='1'
---
    public function actionNupdate(){
        $id = $_POST['id'];
        $name = $_POST['uname'];
        $content = $_POST['content'];
        //print_r($_POST);die;
        $time=date('Y-m-d H:i:s',time());
        $arr=Liuyan::findOne($id);